'''
已知某考试平均分如下：
2013年49.0132分,2014年51.2351分,2015年59.9545分,2016年49.9710分,2017年54.8042分,2018年56.7205分
请预测2013年到2023年的平均分
'''


'2013','2014','2015','2016','2017','2018','2019','2020','2021','2022','2023','2024'

[[2013],[2014],[2015],[2016],[2017],[2018],[2019],[2020],[2021],[2022],[2023],[2024]]

'''
option = {
  title: {
    text: '笔试报考人数预测'
  },
  tooltip: {
    trigger: 'axis'
  },
  legend: {
    data: ['实际人数', '预测人数']
  },
  toolbox: {
    feature: {
      saveAsImage: {}
    }
  },
  xAxis: {
    type: 'category',
    boundaryGap: false,
    data: ['2013','2014','2015','2016','2017','2018','2019','2020','2021','2022','2023','2024']
  },
  yAxis: {
    type: 'value'
  },
  series: [
    {
      name: '实际人数',
      type: 'line',
      label: {
        show: true,
        position: 'top'
      },
      data: [3802,4187,5738,5774,6467,8379]
    },
    {
      name: '预测人数',
      type: 'line',
      label: {
        show: true,
        position: 'bottom'
      },
      data: [3660, 4662, 5250, 5798, 6685, 8289, 10988, 15163, 20197, 25471, 32369, 40277]
    },
  ]
};
'''